Repository: pypi-data/pypi-mirror-210
Catalog: packages/masogram/masogram-1.0.tar.gz/masogram-1.0/docs/locale/*/LC_MESSAGES/dispatcher/filters/command.po
Languages: uk_ua

source: Command
uk_ua: Команди

source: This filter can be helpful for handling commands from the text messages.
uk_ua: Цей фільтр може бути корисним для обробки команд із текстових повідомлень.

source: Works only with :class:`masogram.types.message.Message` events which have the :code:`text`.
uk_ua: Працює лише з подіями :class:`masogram.types.message.Message` , що мають :code:`text`.

source: List of commands (string or compiled regexp patterns)
uk_ua: Перелік команд (рядки або скомпільовані шаблони регулярних виразів)

source: Parameters
uk_ua: Параметри

source: Prefix for command. Prefix is always a single char but here you can pass all of allowed prefixes, for example: :code:`"/!"` will work with commands prefixed by :code:`"/"` or :code:`"!"`.
uk_ua: Префікс для команди. Префікс завжди складається з одного символу, але тут ви можете передати всі дозволені префікси, наприклад: :code:`"/!"` працюватиме з командами з префіксом :code:`"/"` або :code:`"!" `.

source: Ignore case (Does not work with regexp, use flags instead)
uk_ua: Ігнорувати регістр (не працює з регулярним виразом, замість цього використовуйте маркери)

source: Ignore bot mention. By default, bot can not handle commands intended for other bots
uk_ua: Ігнорувати згадку про бота. За замовчуванням бот не може обробляти команди, призначені для інших ботів

source: Validate command object via Magic filter after all checks done
uk_ua: Перевірка об’єкту команди за допомогою магічного фільтра після виконання всіх перевірок

source: When filter is passed the :class:`masogram.filters.command.CommandObject` will be passed to the handler argument :code:`command`
uk_ua: Коли фільтр пройдено, :class:`masogram.filters.command.CommandObject` буде передано аргументу обробника :code:`command`

source: Instance of this object is always has command and it prefix. Can be passed as keyword argument **command** to the handler
uk_ua: Екземпляр цього об’єкта завжди має команду та її префікс. Можна передати обробнику (handler) як аргумент ключового слова **command**

source: Command prefix
uk_ua: Префікс команди

source: Command without prefix and mention
uk_ua: Команда без префікса та згадки

source: Mention (if available)
uk_ua: Згадка (за наявності)

source: Command argument
uk_ua: Аргумент команди

source: Will be presented match result if the command is presented as regexp in filter
uk_ua: Буде представлено результат відповідності, якщо команда представлена як регулярний вираз у фільтрі

source: This command has mention?
uk_ua: Ця команда згадується?

source: Generate original text from object
uk_ua: Створення оригінального тексту з об'єкта

source: Usage
uk_ua: Використання

source: Filter single variant of commands: :code:`Command("start")`
uk_ua: Фільтр єдиного варіанту команд: :code:`Command("start")`

source: Handle command by regexp pattern: :code:`Command(re.compile(r"item_(\d+)"))`
uk_ua: Обробка команди за шаблоном регулярного виразу: :code:`Command(re.compile(r"item_(\d+)"))`

source: Match command by multiple variants: :code:`Command("item", re.compile(r"item_(\d+)"))`
uk_ua: Порівняння команди за кількома варіантами: :code:`Command("item", re.compile(r"item_(\d+)"))`

source: Handle commands in public chats intended for other bots: :code:`Command("command", ignore_mention=True)`
uk_ua: Обробка команди в публічних чатах, призначених для інших ботів: :code:`Command("command", ignore_mention=True)`

source: Use :class:`masogram.types.bot_command.BotCommand` object as command reference :code:`Command(BotCommand(command="command", description="My awesome command")`
uk_ua: Використання об’єкту :class:`masogram.types.bot_command.BotCommand` як посилання на команду :code:`Command(BotCommand(command="command", description="My awesome command")`

source: Command cannot include spaces or any whitespace
uk_ua: Команда не може містити пробілів чи переносів рядків

source: Allowed handlers
uk_ua: Дозволені обробники (handler)

source: Allowed update types for this filter:
uk_ua: Дозволені типи оновлень для цього фільтра:
