Repository: pypi-data/pypi-mirror-210
Catalog: packages/masogram/masogram-1.0.tar.gz/masogram-1.0/docs/locale/*/LC_MESSAGES/dispatcher/dispatcher.po
Languages: uk_ua

source: Dispatcher
uk_ua: Диспетчер

source: Dispatcher is root :obj:`Router` and in code Dispatcher can be used directly for routing updates or attach another routers into dispatcher.
uk_ua: Диспетчер - це кореневий маршрутизатор, і в коді диспетчер може використовуватися безпосередньо для маршрутизації подій або підключення інших маршрутизаторів до диспетчера.

source: Here is only listed base information about Dispatcher. All about writing handlers, filters and etc. you can found in next pages:
uk_ua: Тут наведена лише базова інформація про диспетчер. Усе про написання обробників, фільтрів і т.п. ви можете знайти на наступних сторінках:

source: Root router
uk_ua: Кореневий маршрутизатор

source: Parameters
uk_ua: Параметри

source: Storage for FSM
uk_ua: Сховище для кінцевого автомату (FSM)

source: FSM strategy
uk_ua: Стратегія кінцевого апарату

source: Events isolation
uk_ua: Ізоляція подій

source: Disable FSM, note that if you disable FSM then you should not use storage and events isolation
uk_ua: Відключення кінцевого апарату, зауважте що при вимкненому кінцевому апаратові вам не слід використовувати сховище (кінцевого апарату) та ізоляцію подій

source: Other arguments, will be passed as keyword arguments to handlers
uk_ua: Інші аргументи будуть передані обробникам як іменовані аргументи

source: Main entry point for incoming updates with automatic Dict->Update serializer
uk_ua: Основна точка входу для подій

source: Main entry point for incoming updates Response of this method can be used as Webhook response
uk_ua: Основна точка входу для подій. Відповідь цього метода може бути використана для відповіді у Webhook

source: Run many bots with polling
uk_ua: Запуск кількох ботів з опитуванням

source: Run task for each event and no wait result
uk_ua: Запуск обробки без очікування результату

source: List of the update types you want your bot to receive
uk_ua: Список типів подій, які має опрацьовувати ваш бот

source: contextual data
uk_ua: контекстні дані

source: Returns
uk_ua: Повертає

source: Polling runner
uk_ua: Запуск кількох ботів з опитуванням (асинхронно)

source: Simple usage
uk_ua: Просте застосування

source: Example:
uk_ua: Наприклад:

source: Including routers
uk_ua: Включаючи маршрутизатори

source: Handling updates
uk_ua: Обробка подій

source: All updates can be propagated to the dispatcher by :obj:`Dispatcher.feed_update(bot=..., update=...)` method:
uk_ua: Усі оновлення можна передати диспетчеру через :obj:`Dispatcher.feed_update(bot=..., update=...)` method:
