Repository: pypi-data/pypi-mirror-210
Catalog: packages/bullet-dodger/bullet_dodger-2.1.4-py2.py3-none-any.whl/bullet_dodger/locale/*.po
Languages: eo, pt

source: Bullet dodger
eo: Kugloevitanto
pt: Esquiva-balas

source: output version information and exit
eo: montri programversion kaj eliri
pt: mostra informação de versão e sai

source: manually choose a different language to use.
eo: permane elekti malsaman lingvon por uzi.
pt: escolhe manualmente um idioma diferente para usar.

source: BULLET DODGER
eo: KUGLOEVITANTO
pt: ESQUIVA-BALAS

source: Use the mouse to dodge the bullets
eo: Uzu la muson por eviti la kuglojn
pt: Usa o rato para esquivar as balas

source: Press any mouse button or S when you're ready
eo: Premu ajnan musan klavon aŭ S, kiam vi estas preta
pt: Pressiona qualquer botão do rato ou S quando estiveres pronto

source: Press F11 to toggle full screen
eo: Premu F11 por baskuligi plenan ekranon
pt: Pressiona F11 para alternar ecrã completo

source: {} points
eo: {} poentoj
pt: {} pontos

source: Record: {}
eo: Rekordo: {}
pt: Recorde: {}

source: Paused
eo: Paŭzita
pt: Em pausa

source: You've lost
eo: Vi malvenkis
pt: Perdiste

source: To play again press C or any mouse button
eo: Por ludi denove premu C aŭ ajnan musan klavon
pt: Para jogar novamente pressiona C ou qualquer botão do rato

source: To quit the game press Q
eo: Por eliri el la ludoj premu Q
pt: Para sair do jogo aperta Q
