Repository: pypi-data/pypi-mirror-210
Catalog: packages/aa-fleetpings/aa_fleetpings-2.22.2-py3-none-any.whl/fleetpings/locale/*/LC_MESSAGES/django.po
Languages: uk

source: Fleet Comm
uk: Зв'язок флоту

source: Doctrine
uk: Доктрина

source: Ping Target
uk: Мета пінгу

source: Fleet Type
uk: Тип флоту

source: Timezones module is installed. Link to time zone conversion will be added automatically if you set a date and time here.
uk: Модуль часових поясів встановлено. Посилання на конвертацію часових поясів буде додано автоматично, якщо ви встановите тут дату і час.

source: Hint: You can use {discord_markdown_link} to format the text.
uk: Підказка: Ви можете використовувати {discord_markdown_link} для форматування тексту.

source: Who do you want to ping?
uk: Кого ви хочете пінгувати?

source: Pre-Ping
uk: Попередній пінг

source: Mark this checkbox if this should be a pre-ping.
uk: Відмітьте цей прапорець, якщо це має бути попередній пінг.

source: Ping To
uk: Кого пінгувати

source: Select a channel to ping automatically.
uk: Виберіть канал для автоматичного пінгування.

source: FC Name
uk: Нік ФК

source: Who is the FC?
uk: Хто ФК?

source: Fleet Name
uk: Назва флоту

source: What is the fleet name in fleet finder?
uk: Як називається флот у пошуку флоту?

source: Formup Location
uk: Місце формування

source: Formup Time
uk: Час формування

source: To enable this field, either make it a Pre-Ping (checkbox above) or uncheck &quot;Formup NOW&quot; (checkbox below).
uk: Щоб увімкнути це поле, зробіть його попереднім пінгом (прапорець вище) або зніміть прапорець &quot;Створити зараз&quot; (прапорець нижче).

source: Formup Timestamp
uk: Мітка часу(timestamp) для формування

source: Formup NOW
uk: Формування зараз

source: If this checkbox is active, formup time will be set to &quot;NOW&quot; and the time in the field above (if any is set) will be ignored.
uk: Якщо цей прапорець активний, час формування буде встановлено на &quot;ЗАРАЗ&quot;, а час у полі вище (якщо він встановлений) буде проігноровано.

source: Fleet Comms
uk: Канал зв'язку для флоту

source: Doctrine URL
uk: Посилання на доктрину

source: Webhook Embed Color
uk: Колір вставки Webhook

source: Is this fleet covered by SRP?
uk: Чи поширюється на цей флот дія SRP?

source: Create SRP Link
uk: Створіть SRP-посилання

source: If this checkbox is active, a SRP link specific for this fleet will be created.<br>Leave blank if unsure.
uk: Якщо цей прапорець активний, буде створено SRP-посилання, специфічне для цього флоту.<br>Залишіть порожнім, якщо ви не впевнені.

source: Additional Information
uk: Додаткова інформація

source: Feel free to add some more information about the fleet…
uk: Не соромтеся додавати додаткову інформацію про флот…

source: Create Optimer
uk: Створити таймер операції

source: If this checkbox is active, a fleet operations timer for this pre-ping will be created.
uk: Якщо цей прапорець активний, буде створено таймер операцій флоту для цього попереднього пінгу.

source: You might want to install the Discord service first …
uk: Можливо, ви захочете спочатку встановити службу Discord …

source: Are you sure you have your Discord linked to your Alliance Auth?
uk: Ви впевнені, що ваш Discord пов'язаний з вашим Alliance Auth?

source: This group has not been synced to Discord yet.
uk: Цю групу ще не синхронізовано з Discord.

source: Short name to identify this comms
uk: Коротка назва для ідентифікації цього каналу зв'язку

source: Name
uk: Назва

source: You can add notes about this configuration here if you want
uk: Ви можете додати примітки про цю конфігурацію тут, якщо хочете

source: Whether this comms is enabled or not
uk: Увімкнено цей канал зв'язку чи ні

source: Short name to identify this doctrine
uk: Коротка назва для ідентифікації цієї доктрини

source: A link to a doctrine page for this doctrine if you have.
uk: Посилання на сторінку доктрини для цієї доктрини, якщо вона у вас є.

source: Restrict this doctrine to the following group(s) …
uk: Обмежте цю доктрину наступними групами …

source: Whether this doctrine is enabled or not
uk: Включена ця доктрина чи ні

source: Your doctrine URL is not valid.
uk: Ваше посилання на доктрину невірне.

source: Fleet Doctrine
uk: Доктрина флоту

source: Fleet Doctrines
uk: Доктрини флоту

source: Short name to identify this formup location
uk: Коротка назва для ідентифікації цього місця формування

source: Whether this formup location is enabled or not
uk: Чи ввімкнено це місце формування чи ні

source: Formup Locations
uk: Місця формування

source: Name of the Discord role to ping. (Note: This must be an Auth group that is synced to Discord.)
uk: Ім'я ролі Discord, яку потрібно пінгувати. (Примітка: це має бути група Auth, яка синхронізована з Discord.)

source: ID of the Discord role to ping
uk: Ідентифікатор ролі Discord для пінгування

source: Restrict ping rights to the following group(s) …
uk: Обмежити права на пінг для наступних груп …

source: Discord Ping Target
uk: Ціль для пінгу в Discord

source: Discord Ping Targets
uk: Цілі для пінгу в Discord

source: Short name to identify this fleet type
uk: Коротка назва для ідентифікації цього типу флоту

source: Restrict this fleet type to the following group(s) …
uk: Обмежте цей тип флоту наступними групами …

source: Whether this fleet type is enabled or not
uk: Увімкнено цей тип флоту чи ні

source: Fleet Types
uk: Типи флоту

source: Name of the channel this webhook posts to
uk: Назва каналу, на який публікується цей веб-хук

source: URL of this webhook, e.g. https://discord.com/api/webhooks/123456/abcdef
uk: URL-адреса цього веб-хука, наприклад, https://discord.com/api/webhooks/123456/abcdef

source: You can add notes about this webhook here if you want
uk: Ви можете додати примітки про цей вебхук тут, якщо хочете

source: Whether this webhook is active or not
uk: Активний цей вебхук чи ні

source: Webhook
uk: Веб-хук

source: Webhooks
uk: Веб-хуки

source: Invalid webhook URL. The webhook URL you entered does not match any known format for a Discord webhook. Please check the webhook URL.
uk: Неправильна URL-адреса веб-хука. Введена вами URL-адреса веб-хука не відповідає жодному з відомих форматів веб-хуків Discord. Будь ласка, перевірте URL-адресу веб-хука.

source: Default highlight color for the webhook embed.
uk: Виділіть колір для вставки.

source: Fleet Information
uk: Інформація про флот

source: Formatted Ping Text
uk: Відформатований текст пінгу

source: Mandatory information is missing. To create an optimer, you need to provide all of the following information:<br>» FC Name<br>» Fleet Name<br>» Formup Location<br>» Formup Time<br>» Ships / Doctrine
uk: Обов'язкова інформація відсутня. Для того щоб створити пінг флотової операції ви маєте заповнити всю інформацію нижче: <br>» Нік ФК<br>» Назва флоту<br>» Місце формування<br>» Чис формування<br>» Кораблі / Доктрина

source: Mandatory information is missing. To create an SRP link, you need to provide all of the following information:<br>» Fleet Name<br>» Ships / Doctrine
uk: Обов'язкова інформація відсутня. Щоб створити посилання SRP, вам потрібно надати всю наступну інформацію: <br> » Назва флоту <br> » Кораблі / Доктрина

source: Error! Your ping was not copied to your clipboard. Maybe your browser doesn&apos;t support this feature.
uk: Помилка! Ваш пінг не було скопійовано до буфера обміну. Можливо, ваш браузер не підтримує цю функцію.

source: Success! Your ping text has been copied to your clipboard. Now be a good FC and throw it in your chat so you actually get some people in fleet.
uk: Успішно! Текст вашого пінгу було скопійовано до буфера обміну. Тепер будь хорошим ФК і кинь його у свій чат, щоб дійсно отримати кілька людей у флот.

source: Create Ping
uk: Створити пінг

source: Please think twice if you really need to ping <code>@everyone</code>.
uk: Будь ласка, подумайте двічі, якщо вам дійсно потрібно пінгувати <code>@everybody</code>.

source: <code>@everyone</code> includes also all the people in this channel who are offline and possibly asleep at the moment and might be waking up when their mobile devices ping. Or they wake up hours later to irrelevant pings by the time they open Discord.
uk: <code>@everyone</code> включає всіх людей в цьому каналі, які не в мережі, можливо сплять в цей момент, але можуть прокинутися, коли їх мобільні пристрої сповіщатимуть. Або вони прокинуться годинами пізніше до непотрібних повідомлень, коли вони відкриють Discord.

source: Notification spam is a real thing and might entice people to mute channels.
uk: Спам у сповіщеннях - це реальна річ, і він може спокусити людей вимкнути канали.

source: <code>@here</code> usually does the trick just fine.
uk: <code>@here</code> зазвичай чудово справляється з цим завданням.

source: Please select
uk: Будь ласка, оберіть

source: Roaming Fleet
uk: Роумінговий флот

source: Home Defense
uk: Захист дому

source: StratOP
uk: Стратегічна операція

source: CTA
uk: КТА

source: Additionally configured fleet types
uk: Додатково налаштовані типи флоту

source: None, just format it for me
uk: Ні, просто відформатуйте для мене

source: Don't Ping
uk: Не пінгувати

source: Additionally configured ping targets
uk: Додатково налаштовані цілі пінгу

source: No ping created yet …
uk: Пінг ще не створено …

source: Copy Ping Text
uk: Скопіювати текст пінгу

source: Not all mandatory information available to create an SRP link.
uk: Не вся обов'язкова інформація доступна для створення SRP-посилання.

source: Fleet operations timer has been created …
uk: Створено таймер операцій флоту …

source: SRP link has been created …
uk: Створено SRP-посилання …

source: Form invalid. Please check your input.
uk: Форма невірна. Будь ласка, перевірте свої дані.

source: No form data submitted.
uk: Не подано жодних даних.
