Repository: pypi-data/pypi-mirror-210
Catalog: packages/pretix-covid-certificates/pretix_covid_certificates-2.3.1-py3-none-any.whl/pretix_covid_certificates/locale/*_Informal/LC_MESSAGES/django.po
Languages: de

source: Digital Covid Certificates
de: Digitale Covid Zertifikate

source: This plugin allows to configure the validation of COVID test- and vaccination certificates using pretixSCAN for Android
de: Diese Erweiterung erlaubt die Konfiguration der Abfrage von COVID Test- und Impfzertifikaten bei Nutzung von pretixSCAN auf Android

source: COVID Certificate Validation
de: COVID Zertifikat Validierung

source: Digital COVID Certificate Validation
de: Digitale COVID Zertifikat Validierung

source: With more and more locations opening up in the aftermath of the Corona crisis, many event organizers face the challenge of verifying the health status of their participants. Some public health authorities even mandate event organizers to make sure, that only people of a certain status are allowed on the premises.
de: Im Zuge der Wiederöffnung von Einrichtungen im Nachgang der Corona-Krise, stehen viele Veranstalter vor der Herausforderung den Gesundheitszustand der Besucher zu überprüfen. Einige Gesundheitsbehörden verpflichten sogar Veranstalter sicherzustellen, dass nur Teilnehmer mit gewissen Stati Zugang erlaubt wird.

source: Using pretixSCAN on Android (and only on Android), you can now scan a variety of vaccination passports and COVID test certificates. The information therein is validated and displayed on the screen of your device, allowing for a faster and more comfortable checkin experience.
de: Mit Hilfe von pretixSCAN auf Android-Geräte (und auch nur auf Android-Geräten) können eine Vielzahl von Impfnachweisen und COVID Testzertifikaten gescannt werden. Der Inhalt der Zertifikate wird validiert und das Ergebnis auf dem Bildschirm angezeigt. Dies erlaubt einen einfacheren und schnelleren Check-In.

source: No personal identifiable information (PII) is collected through this process. pretix will however save the validity of the proof shown in order to minimize the revalidation effort necessary.
de: Bei Nutzung diesen Prozesses werden keine personenbezogenen Daten gespeichert. pretix wird jedoch die Gültigkeit des vorgezeigten Nachweises speichern um wiederholte Überprüfungen überflüssig zu machen.

source: Validating digital vaccination passports and test result certificates is only possible with pretixSCAN 1.11.0 or newer on Android 6.0 or newer!
de: Die Validierung von Impfnachweisen und Testzertifikaten ist nur mit pretixSCAN 1.11.0 oder neuer auf Android 6.0 oder neuer möglich!

source: Our validation algorithm for digital certificates is based on the official German validation apps. Please make sure to regularly update pretixSCAN to make sure you do not miss any changes. Also, if you are based in another country, we don't know how well the German validation rules map to the local regulations in your country. Please test carefully if this is appropriate for you to use.
de: Unser Validierungsalgorithmus für digitale Zertifikate basiert auf den offiziellen deutschen Validierungs-Apps. Bitte stelle sicher, dass pretixSCAN regelmäßig aktualisiert wird um keine Änderungen zu verpassen. Solltest Du außerhalb von Deutschland sein, können wir nicht beurteilen wie gut die deutschen Regeln zur Validierung anwendbar sind. Bitte teste daher die Validierung ausführlich um sicherzustellen dass die Validierung für Dich sinnvolle Ergebnisse liefert.

source: Save
de: Speichern

source: NVX-CoV2373 (old name of Nuvaxovid)
de: NVX-CoV2373 (alter Name von Nuvaxovid)

source: Covacin (also known as BBV152 A, B, C)
de: Covacin (auch bekannt als BBV152 A, B, C)

source: Any one of the certificate types enabled below
de: 3G/2G: Ein beliebiger der unten aktivierten Zertifikatstypen

source: One immunization certificate (vaccinated or cured) PLUS one test certificate
de: 2G+: Ein Immunisierungsnachweis (geimpft oder genesen) PLUS ein Testnachweis

source: One immunization certificate (vaccinated or cured) PLUS one test certificate (only without booster vaccination, no test for cured attendees)
de: 2G+: Ein Immunisierungsnachweis (geimpft oder genesen) PLUS ein Testnachweis (kein Test bei Auffrischimpfung, kein Test für Genesene)

source: One immunization certificate (vaccinated or cured) PLUS one test certificate (only if vaccinated more than 180 days ago and no booster vaccination, no test for cured attendees)
de: 2G+: Ein Immunisierungsnachweis (geimpft oder genesen) PLUS ein Testnachweis (kein Test bei Auffrischimpfung, kein Test wenn Impfung weniger als 180 Tage alt, kein Test für Genesene)

source: One immunization certificate (vaccinated or cured) PLUS one test certificate (only if vaccinated more than 180 days ago, no test for cured attendees)
de: 2G+: Ein Immunisierungsnachweis (geimpft oder genesen) PLUS ein Testnachweis (kein Test wenn Impfung weniger als 180 Tage alt, kein Test für Genesene)

source: One vaccination certificate PLUS either one cured certificate (28-90 days old) OR one test certificate (no test if vaccinated less 90 days ago, no test with booster vaccination)
de: 2G+: Ein Impfnachweis PLUS entweder ein Genesungsnachweis (28-90 Tage alt) ODER ein Testnachweis (kein Test wenn Impfung weniger als 90 Tage alt, kein Test mit Booster)

source: Check type
de: Art der Prüfung

source: Every option other than the first one is only supported on pretixSCAN 1.13.1 or newer.
de: Alle Optionen außer der ersten werden erst ab pretixSCAN 1.13.1 unterstützt.

source: Record results
de: Ergebnisse speichern

source: With this option enabled, pretixSCAN will record that a certificate has been scanned. It will only record which type of certificate has been scanned if you activate the respective options below. If you disable this, pretixSCAN will ask for the certificate on every subsequent scans. The question created in the system must not be required. Disabling this is only supported on pretixSCAN 1.13.3 or newer.
de: Mit dieser Option merkt sich pretixSCAN, dass ein Zertifikat gescannt wurde. Es wird nur gespeichert, um was für ein Zertifikat es sich handelt, wenn die entsprechende Option weiter unten gewählt wurde. Wenn diese Option deaktiviert ist, fragt pretixSCAN bei jedem Einlass erneut nach dem Zertifikat. Die im System hinterlegte Frage darf in diesem Fall kein Pflichtfeld sein. Die Deaktivierung erfordert pretixSCAN 1.13.3 oder neuer.

source: Allow vaccinated
de: Erlaube Impfungen

source: Only participants that have received the complete treatment (two doses with the exception of designated single-dose vaccines) are deemed completely vaccinated.
de: Nur Teilnehmer die eine volle Impfserie (i.d.R. zwei Impfdosen, mit Ausnahme von wenigen Einzeldosen-Impfstoffen) erhalten haben werden als vollständig geimpft angesehen.

source: Vaccinated at least
de: Mindestens geimpft seit

source: days ago
de: Tagen

source: Vaccinated at most
de: Längstens geimpft seit

source: Record proof
de: Speichere Nachweisart

source: With this option enabled, pretixSCAN will record what kind of certificate (vaccination, recovery, PCR- or Antigen-test) has been presented by the visitor. Saving this information is highly regulated in most countries and therefore not recommended. Only enable this option if you are required by your local health authorities to collect such information.
de: Ist diese Option aktiviert, speichert pretixSCAN welche Art von Nachweis (Geimpft, Genesen, PCR- oder Antingen-Test) vom Teilnehmer vorgewiesen wurde. Die Speicherung von dieser Art von Informationen ist in den meisten Ländern sehr stark reguliert und daher nicht empfohlen. Aktiviere diese Option nur, wenn Du von deiner lokalen Gesundheitsbehörden aufgeforderst wurde, diese Information zu speichern.

source: Accepted vaccine products
de: Akzeptierte Impfstoffe

source: Only supported on pretixSCAN 1.13.3 or newer.
de: Anpassung nur mit pretixSCAN 1.13.3 oder neuer unterstützt.

source: Allow cured
de: Erlaube Genesene

source: Only participants that have gone through and recovered from a COVID-infection are deemed cured.
de: Nur Teilnehmer die eine COVID-Erkrankung überstanden haben und sich vollständig von COVID geheilt wurden gelten als genesen.

source: Cured at least
de: Mindestens genesen seit

source: Cured at most
de: Längstens genesen seit

source: Allow tested (PCR)
de: Erlaubte Getestete (PCR)

source: This covers exclusively participants having received a negative PCR-test.
de: Dies beschränkt sich ausschließlich auf Teilnehmer die einen negativenPCR-Test vorweisen können.

source: PCR tested at least
de: Mindestalter PCR-Test

source: hours ago
de: Stunden

source: PCR tested at most
de: Maximalalter PCR-Test

source: Allow tested (Antigen or unknown)
de: Erlaube Getestete (Antigen und Sonstige)

source: This covers exclusively participants having received a negative Antigen-test or any other type of test (with the exception of PCR-tests).
de: Dies beschränkt sich ausschließlich auf Teilnehmer die einen negativen Antigen-Test oder andere Art von Test (mit Ausnahme von PCR-Tests) vorweisen können.

source: Antigen/other tested at least
de: Mindestalter Antingen/sonstige Tests

source: Antigen/other tested at most
de: Maximalalter Antigen/sonstige Tests

source: Allow other forms of proof
de: Andere Art des Nachweises erlauben

source: Record validity time
de: Speichere Dauer der Nachweisgültigkeit

source: With this option enabled, pretixSCAN will record at which the certificate becomes invalid according to the rules stated above. pretix will automatically remove the stored certificate around this time (there can be a small variance) so the person will need to show a new certificate on re-entry. All certificates where a date cannot be computed (such as non-digital certificates) will be considered valid until the end of the current day.
de: Mit dieser Option speichert pretixSCAN den Zeitpunkt, zu dem der Nachweis aufgrund der oben genannten Regeln ungültig wird. pretix wird das Zertifikat dann automatisch ungefähr zu diesem Zeitpunkt aus der Datenbank löschen, sodass bei einem erneuten Eintritt ein neues Zertifikat gezeigt werden muss. Ist das Gültigkeitsdatum nicht bekannt (wie z.B. bei nicht-digitalen Nachweisen) wird als Gültigkeitsdatum das Ende des aktuellen Tages verwendet.

source: Accept EU DGC (Digital Green Certificate)
de: Akzeptiere EU DGC (Digitales Grünes Zertifikat)

source: Accept manual override
de: Akzeptiere manuelle Freigabe

source: This options allows your staff to manually set the vaccination status for a participant - for example if they present their yellow vaccination booklet or any other form of certificate which cannot be processed automatically.
de: Diese Option erlaubt es dem Personal manuell den Status für einen Teilnehmer zu setzen - bspw. wenn der gelbe Impfpass oder ein alternatives Zertifikat vorgewiesen wird, welches nicht automatisch verarbeitet werden kann.

source: This question has been created automatically by the Digital COVID Certificate Validation plugin. Please do not change its internal identifier.
de: Diese Frage wurde automatisch von der Erweiterung zur Prüfung von Digitalen COVID Zertifikaten. Bitte ändere nicht die Interne Referenz.

source: Please select the products that require COVID certificate validation.
de: Bitte wähle die Produkte welche eine Überprüfung eines COVID-Zertifikates erfordern.
